### Terraform Plan: `dev`
```
module.platform.module.eks.data.aws_region.current: Reading...
module.platform.data.aws_caller_identity.current: Reading...
module.platform.module.vpc.aws_cloudwatch_log_group.flow_logs: Refreshing state... [id=/aws/vpc/platform-sre-demo-dev/flow-logs]
module.platform.module.vpc.aws_vpc.this: Refreshing state... [id=vpc-081b2c533af96b693]
module.platform.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-05cf920ba166ca4d4]
module.platform.data.aws_region.current: Reading...
module.platform.module.eks.aws_kms_key.eks: Refreshing state... [id=ca248d76-0f55-4f6c-8013-64eb4fe8c2f5]
module.platform.module.vpc.aws_iam_role.flow_logs: Refreshing state... [id=platform-sre-demo-dev-vpc-flow-logs-role]
module.platform.module.eks.aws_iam_role.cluster: Refreshing state... [id=platform-sre-demo-dev-eks-cluster-role]
module.platform.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.platform.module.eks.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.platform.module.eks.aws_iam_role.node_group: Refreshing state... [id=platform-sre-demo-dev-eks-node-role]
module.platform.data.aws_caller_identity.current: Read complete after 0s [id=936249129410]
module.platform.module.eks.aws_kms_alias.eks: Refreshing state... [id=alias/platform-sre-demo-dev-eks-secrets]
module.platform.module.eks.aws_iam_role_policy_attachment.cluster_policy: Refreshing state... [id=platform-sre-demo-dev-eks-cluster-role-20260305015456026500000008]
module.platform.module.eks.aws_iam_role_policy_attachment.cluster_vpc_controller: Refreshing state... [id=platform-sre-demo-dev-eks-cluster-role-20260305015456030300000009]
module.platform.module.eks.aws_iam_role_policy_attachment.node_cni: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260305015455912300000007]
module.platform.module.eks.aws_iam_role_policy_attachment.node_ecr: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260305015455785600000005]
module.platform.module.eks.aws_iam_role_policy_attachment.node_ssm: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260305015455772600000003]
module.platform.module.eks.aws_iam_role_policy_attachment.node_worker: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260305015455838500000006]
module.platform.module.vpc.aws_iam_role_policy.flow_logs: Refreshing state... [id=platform-sre-demo-dev-vpc-flow-logs-role:flow-logs-policy]
module.platform.module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0a8d63a96d3bc635a]
module.platform.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-004a88ce4ac96fe75]
module.platform.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0debce813955a6d26]
module.platform.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-05076878a06bbc99d]
module.platform.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bea391b39cfb1ca3]
module.platform.module.vpc.aws_route_table.database: Refreshing state... [id=rtb-06828d18e4480eb9f]
module.platform.module.vpc.aws_flow_log.this: Refreshing state... [id=fl-0402ef0bfd82775e5]
module.platform.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0527efd673fa6e980]
module.platform.module.eks.aws_security_group.cluster: Refreshing state... [id=sg-0850ca35df6b2edf7]
module.platform.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00538bd90e1a655c6]
module.platform.module.eks.aws_security_group.node: Refreshing state... [id=sg-0d2dd2bb5ad7eb035]
module.platform.module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0ea022c24b50b7d79]
module.platform.module.eks.aws_eks_cluster.this: Refreshing state... [id=platform-sre-demo-dev-eks]
module.platform.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-014665f758c356b4f]
module.platform.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0c86920ecc761e13e]
module.platform.module.vpc.aws_db_subnet_group.this: Refreshing state... [id=platform-sre-demo-dev-db-subnet-group]
module.platform.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-015cb91eda7bd7cd5]
module.platform.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fd3aa42725612cf9]
module.platform.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0265f4eb938bfcc7a]
module.platform.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0bb99911d921e0c7e]
module.platform.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03a7b4e3b7c8bc67c]
module.platform.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09a1934cfc4882210]
module.platform.module.eks.aws_eks_addon.vpc_cni: Refreshing state... [id=platform-sre-demo-dev-eks:vpc-cni]
module.platform.module.eks.aws_eks_addon.kube_proxy: Refreshing state... [id=platform-sre-demo-dev-eks:kube-proxy]
module.platform.module.eks.data.tls_certificate.eks: Reading...
module.platform.module.eks.aws_eks_node_group.default: Refreshing state... [id=platform-sre-demo-dev-eks:platform-sre-demo-dev-eks-default]
module.platform.data.aws_eks_cluster_auth.this: Reading...
module.platform.data.aws_eks_cluster_auth.this: Read complete after 0s [id=platform-sre-demo-dev-eks]
module.platform.module.eks.data.tls_certificate.eks: Read complete after 0s [id=b1b539daa206035ae3c3e28288b0681fa1b462f3]
module.platform.module.eks.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::936249129410:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/D2236B40F30E2B5FB43CD77D10EB1274]
module.platform.module.eks.aws_eks_addon.coredns: Refreshing state... [id=platform-sre-demo-dev-eks:coredns]
module.platform.module.rds.random_password.db: Refreshing state... [id=none]
module.platform.module.rds.aws_db_subnet_group.this: Refreshing state... [id=platform-sre-demo-dev-rds]
module.platform.module.observability.aws_kms_key.sns: Refreshing state... [id=2a010c76-a9aa-40f2-8848-62c5c6b66ac6]
module.platform.module.rds.aws_db_parameter_group.this: Refreshing state... [id=platform-sre-demo-dev-pg16-20260305015454928800000002]
module.platform.module.rds.aws_iam_role.rds_monitoring: Refreshing state... [id=platform-sre-demo-dev-rds-monitoring]
module.platform.module.rds.aws_security_group.rds: Refreshing state... [id=sg-09cb5f6bfa5ef9362]
module.platform.module.rds.aws_kms_key.rds: Refreshing state... [id=3015a26f-6f09-4587-8503-b868ad2f1b07]
module.platform.module.rds.aws_secretsmanager_secret.db: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:936249129410:secret:platform-sre-demo-dev/rds/credentials-zsekwR]
module.platform.module.rds.aws_security_group_rule.rds_ingress[0]: Refreshing state... [id=sgrule-3724683362]
module.platform.module.rds.aws_secretsmanager_secret_version.db: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:936249129410:secret:platform-sre-demo-dev/rds/credentials-zsekwR|terraform-20260305020344885100000012]
module.platform.module.observability.aws_sns_topic.alerts: Refreshing state... [id=arn:aws:sns:us-east-1:936249129410:platform-sre-demo-dev-alerts]
module.platform.module.rds.aws_iam_role_policy_attachment.rds_monitoring: Refreshing state... [id=platform-sre-demo-dev-rds-monitoring-20260305015455784200000004]
module.platform.module.observability.aws_cloudwatch_metric_alarm.rds_storage_low: Refreshing state... [id=platform-sre-demo-dev-rds-storage-low]
module.platform.module.observability.aws_cloudwatch_metric_alarm.node_cpu_high: Refreshing state... [id=platform-sre-demo-dev-node-cpu-high]
module.platform.module.observability.aws_cloudwatch_metric_alarm.rds_cpu_high: Refreshing state... [id=platform-sre-demo-dev-rds-cpu-high]
module.platform.module.observability.aws_cloudwatch_metric_alarm.node_memory_high: Refreshing state... [id=platform-sre-demo-dev-node-memory-high]
module.platform.module.rds.aws_db_instance.this: Refreshing state... [id=db-EEXQBOP2XDD4UQYMYX6Q7A3EII]
module.platform.module.app.kubernetes_namespace.app: Refreshing state... [id=demo]
module.platform.module.app.kubernetes_config_map.app: Refreshing state... [id=demo/platform-sre-demo-config]
module.platform.module.app.kubernetes_service.app: Refreshing state... [id=demo/platform-sre-demo]
module.platform.module.app.kubernetes_deployment.app: Refreshing state... [id=demo/platform-sre-demo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.platform.module.app.kubernetes_service.app will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "demo/platform-sre-demo"
        # (2 unchanged attributes hidden)

      ~ spec {
          ~ type                              = "ClusterIP" -> "LoadBalancer"
            # (12 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.platform.module.eks.aws_iam_policy.lb_controller will be created
  + resource "aws_iam_policy" "lb_controller" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "platform-sre-demo-dev-eks-lb-controller"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeTrustStores",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
    }

  # module.platform.module.eks.aws_iam_role.lb_controller will be created
  + resource "aws_iam_role" "lb_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/D2236B40F30E2B5FB43CD77D10EB1274:aud" = "sts.amazonaws.com"
                              + "oidc.eks.us-east-1.amazonaws.com/id/D2236B40F30E2B5FB43CD77D10EB1274:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::936249129410:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/D2236B40F30E2B5FB43CD77D10EB1274"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-sre-demo-dev-eks-lb-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + unique_id             = (known after apply)
    }

  # module.platform.module.eks.aws_iam_role_policy_attachment.lb_controller will be created
  + resource "aws_iam_role_policy_attachment" "lb_controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "platform-sre-demo-dev-eks-lb-controller"
    }

  # module.platform.module.eks.helm_release.lb_controller will be created
  + resource "helm_release" "lb_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.7.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "platform-sre-demo-dev-eks"
        }
      + set {
          + name  = "region"
          + value = "us-east-1"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "true"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
        }
      + set {
          + name  = "vpcId"
          + value = "vpc-081b2c533af96b693"
        }
    }

  # module.platform.module.observability.data.aws_cloudwatch_log_group.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_cloudwatch_log_group" "eks" {
      + arn               = (known after apply)
      + creation_time     = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/platform-sre-demo-dev-eks/cluster"
      + retention_in_days = (known after apply)
      + tags              = (known after apply)
    }

  # module.platform.module.rds.aws_db_parameter_group.this will be updated in-place
  ~ resource "aws_db_parameter_group" "this" {
        id           = "platform-sre-demo-dev-pg16-20260305015454928800000002"
        name         = "platform-sre-demo-dev-pg16-20260305015454928800000002"
        tags         = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "platform-sre-demo"
            "Repository"  = "sre-assessment"
        }
        # (6 unchanged attributes hidden)

      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "rds.force_ssl" -> null
          - value        = "1" -> null
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "rds.force_ssl"
          + value        = "1"
        }
    }

  # module.platform.module.rds.aws_secretsmanager_secret_version.db must be replaced
-/+ resource "aws_secretsmanager_secret_version" "db" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-1:936249129410:secret:platform-sre-demo-dev/rds/credentials-zsekwR" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-1:936249129410:secret:platform-sre-demo-dev/rds/credentials-zsekwR|terraform-20260305020344885100000012" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20260305020344885100000012" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
*Triggered by @ahalsey in b8523b1b0ca1e42ef3c6854c9a8ba7cf7a22af0d*